02_Modelagem_UML_Astah/UC11_Realizar_Simulado_ENADE/README.md
```mermaid
sequenceDiagram
    autonumber
    participant A as :Aluno
    participant S as :Simulado
    participant T as :Temporizador
    A->>S: iniciarTeste()
    S->>T: iniciar()
    A->>S: responder()
    S-->>A: Nota Final
```
